/*******************************************************************************************/
/*  File Name      : mainapi_1.c                                                           */
/*  Contents       : Application main                                                      */
/*  Author         : NEC Electronics Corporation                                           */
/*  History        :                                                                       */
/*           Date         Version   Author                       Note                      */
/*           2008.01.31   V01.00    NEC Electronics Corporation  New creation              */
/*                                                                                         */
/* +++++ Function List +++++                                                               */
/*  main()                     メイン                                                      */
/*  Set_MsgNoBuff()            FlexRayメッセージバッファ番号設定処理                       */
/*                                                                                         */
/*******************************************************************************************/
/*******************************************************************************************/
/* ヘッダファイル                                                                          */
/*******************************************************************************************/
#include "typedefine.h"
#include "v850drv.h"
#include "lcddrv.h"
#include "flexrayapi.h"
#include "applicationcom.h"
#include "mainapi_1.h"

/*******************************************************************************************/
/*  関数名       : メイン                                                                  */
/*  引数         : なし                                                                    */
/*  戻り値       : なし                                                                    */
/*  詳細内容     : メイン処理                                                              */
/*                                                                                         */
/*******************************************************************************************/
void main(void){

    /***************************************************************************************/
    /* 変数宣言                                                                            */
    /***************************************************************************************/
    FrReturnType Ret_StartUp_u08;     /* Startup結果 */
    FrReturnType PocState_u08;        /* POC状態    */
    u08 BitData_u08;                  /* ビット反転 */
    
    /***************************************************************************************/
    /* 変数初期化                                                                          */
    /***************************************************************************************/
    Ret_StartUp_u08 = NO_STATE;
    PocState_u08 = NO_STATE;
    BitData_u08  = CLEAR;

    /***************************************************************************************/
    /* 割込み禁止                                                                          */
    /***************************************************************************************/
    __DI();

    /***************************************************************************************/
    /* MCU初期化                                                                           */
    /***************************************************************************************/
    V850Drv_init();

    /***************************************************************************************/
    /* MCUタイマ設定                                                                       */
    /***************************************************************************************/
    V850Drv_timerA0_set(MCU_TIMER_TIME, INT_LEVEL4);

    /***************************************************************************************/
    /* アプリケーション初期化                                                              */
    /***************************************************************************************/
    gNodeNo_u08           = NODE_NO;            /* 自ノード番号(1～3)                     */
    gInterruptFlg_u08     = CLEAR;              /* 割込みフラグ                           */
    gNmiCnt_u08           = CLEAR;              /* NMI押下回数(0～255)                    */
    gStaticFrameCnt_u08   = CLEAR;              /* スタティックフレーム送信回数(0～255)   */
    gNmiFlg_BOOL          = OFF;                /* NMI押下フラグ(ON or OFF)               */
    gLedSendFlg_BOOL      = OFF;                /* LED送信のLED点灯消灯フラグ(ON or OFF)  */
    gLedBaseFlg_BOOL      = OFF;                /* 自ノードのLED点灯消灯フラグ(ON or OFF) */
    gErayTimerSendCnt_u08 = CLEAR;              /* E-Rayタイマ0カウンタ送信用             */
    gErayTimerLedCnt_u08  = CLEAR;              /* E-Rayタイマ0カウンタLED用              */
    gPocStateLcd_Save_u08 = NO_STATE;           /* LCD表示時のPOC状態                     */

    /***************************************************************************************/
    /* メッセージバッファ番号設定                                                          */
    /***************************************************************************************/
    Set_MsgNoBuff();

    /***************************************************************************************/
    /* LED初期化                                                                           */
    /***************************************************************************************/
    V850Drv_led_output(POS_LED_ALL, OFF);

    /***************************************************************************************/
    /* LCD初期化                                                                           */
    /***************************************************************************************/
    /* LCD初期化 */
    LcdDrv_init();

    /* POCラベルのLCD出力 */
    AppCom_Output_LcdLabel(gNodeNo_u08);

    /***************************************************************************************/
    /* E-Ray起動                                                                           */
    /***************************************************************************************/
    /* E-Rayリセット */
    FrAPI_eray_reset();

    /* E-Ray初期化 */
    FrAPI_eray_init();
    
    /***************************************************************************************/
    /* MCUタイマ開始                                                                       */
    /***************************************************************************************/
    /* MCUタイマA0開始 */
    V850Drv_timerA0_on_off(MCU_TIMER_START);

    /***************************************************************************************/
    /* 割込み許可                                                                          */
    /***************************************************************************************/
    __EI();

    /***************************************************************************************/
    /* E-Ray開始                                                                           */
    /***************************************************************************************/
    /* E-Ray開始 */
    Ret_StartUp_u08 = FrAPI_start_up();
    if(Ret_StartUp_u08 == FLEXRAY_STATUS_OK){

        /***********************************************************************************/
        /* E-Rayフラグクリア                                                               */
        /***********************************************************************************/
        /* E-Rayエラーフラグクリア */
        FrAPI_flg_clear(ERROR_INF, ERAY_FLG_CLEAR);

        /* E-Ray状態フラグクリア */
        FrAPI_flg_clear(STATUS_INF, ERAY_FLG_CLEAR);

        /* E-Rayチャネル状態フラグクリア */
        FrAPI_flg_clear(CHANNEL_INF, ERAY_FLG_CLEAR);

        /***********************************************************************************/
        /* E-Rayステータス割り込み開始                                                     */
        /***********************************************************************************/
        /* E-Rayステータス割込み設定 */
        V850Drv_interrupt_conf(INT_FRIC0, INT_LEVEL3);

        /***********************************************************************************/
        /* E-Rayタイマ開始                                                                 */
        /***********************************************************************************/
        /* E-Rayタイマ0割込み設定 */
        V850Drv_interrupt_conf(INT_FRIC2, INT_LEVEL4);
    
        /* E-Rayタイマ0設定 */
        /* E-Rayタイマ0はコンフィグレータで設定済み             */
        /*   API設定例)                                         */
        /*     タイマ0・連続モード・64サイクル・オフセット0MT   */
        /* FrAPI_eray_timer0_set(TIMER_CONTINUE_MODE,0x40,0x0); */

        /* E-Rayタイマ0開始 */
        FrAPI_eray_timer0_on_off(ERAY_TIMER_START);

    }else{}     /* 処理なし */

    /***************************************************************************************/
    /* 無限ループ                                                                          */
    /***************************************************************************************/
    while(1)
    {

        /***********************************************************************************/
        /* POC更新(MCUタイマA0割込み)処理                                                  */
        /***********************************************************************************/
        if( gInterruptFlg_u08 & MASK_INT_MCUTIMER ){
            AppCom_PocUpdate();
            BitData_u08 = ~MASK_INT_MCUTIMER;
            __DI();
            gInterruptFlg_u08 &= BitData_u08;
            __EI();
        
        }else{}     /* 処理なし */

        /***********************************************************************************/
        /* 受信とスタティックフレーム送信(E-Rayステータス割込み)処理                       */
        /***********************************************************************************/
        if( gInterruptFlg_u08 & MASK_INT_ERAYSTATUS ){
            AppCom_RecSend();
            BitData_u08 = ~MASK_INT_ERAYSTATUS;
            __DI();
            gInterruptFlg_u08 &= BitData_u08;
            __EI();
        
        }else{}     /* 処理なし */

        /***********************************************************************************/
        /* LED更新とスタティックフレーム送信(E-Rayタイマ0割込み)処理                       */
        /***********************************************************************************/
        if( gInterruptFlg_u08 & MASK_INT_ERAYTIMER ){
            AppCom_LedUpdate();
            BitData_u08 = ~MASK_INT_ERAYTIMER;
            __DI();
            gInterruptFlg_u08 &= BitData_u08;
            __EI();

        }else{}     /* 処理なし */

        /***********************************************************************************/
        /* FlexRay通信状態チェック                                                         */
        /***********************************************************************************/
        /* POC状態取得 */
        PocState_u08 = FrAPI_poc_state_get();

        /* FlexRay通信異常チェック */
        if( (PocState_u08 != NORMAL_ACTIVE_STATE)
         || (Ret_StartUp_u08 != FLEXRAY_STATUS_OK) ){

            /* FlexRayリスタート処理 */
            Ret_StartUp_u08 = AppCom_FlexRay_Restart();

        }else{}     /* 処理なし */
    }

}/* main */
/*******************************************************************************************/
/*  関数名       : FlexRayメッセージバッファ番号設定処理                                   */
/*  引数         : なし                                                                    */
/*  戻り値       : なし                                                                    */
/*  詳細内容     : ノード固有のメッセージバッファ番号をグローバルに設定する                */
/*                 (clusterNode_*.hのBufferHeader_u16[128][10]のメッセージバッファ番号)    */
/*******************************************************************************************/
static void Set_MsgNoBuff(void){

    /* ノード固有の送信バッファ番号設定 */
    stMsgNoBuff.sfSendSendCnt = SF_SEND_MSGID_SENDCNT;  /* 送信回数フレーム(node1)        */
    stMsgNoBuff.sfSendLed     = SF_SEND_MSGID_LED;      /* LEDデータフレーム(node1)       */
    stMsgNoBuff.dfSendNmiA    = DF_SEND_MSGID_NMI_A;    /* NMI押下回数フレーム chA(node1) */
    stMsgNoBuff.dfSendNmiB    = DF_SEND_MSGID_NMI_B;    /* NMI押下回数フレーム chB(node1) */

    /* ノード固有の受信バッファ番号設定 */
    stMsgNoBuff.sfRec1SendCnt = SF_REC1_MSGID_SENDCNT;  /* 送信回数フレーム(node2)        */
    stMsgNoBuff.sfRec2SendCnt = SF_REC2_MSGID_SENDCNT;  /* 送信回数フレーム(node3)        */
    stMsgNoBuff.sfRec1Led     = SF_REC1_MSGID_LED;      /* LEDデータフレーム(node2)       */
    stMsgNoBuff.sfRec2Led     = SF_REC2_MSGID_LED;      /* LEDデータフレーム(node3)       */
    stMsgNoBuff.dfRec1NmiA    = DF_REC1_MSGID_NMI_A;    /* NMI押下回数フレーム chA(node2) */
    stMsgNoBuff.dfRec1NmiB    = DF_REC1_MSGID_NMI_B;    /* NMI押下回数フレーム chA(node2) */
    stMsgNoBuff.dfRec2NmiA    = DF_REC2_MSGID_NMI_A;    /* NMI押下回数フレーム chB(node3) */
    stMsgNoBuff.dfRec2NmiB    = DF_REC2_MSGID_NMI_B;    /* NMI押下回数フレーム chB(node3) */

}/* Set_MsgNoBuff */
